<!-- 文本 输入框，单行输入 -->
<template>

</template>

<script setup lang="ts">
import { ref, shallowRef, } from "vue";

// *****************************************   👉  组件定义    *****************************************
//  1、props、event、model、components

//  2、组件交互变量、常量


// *****************************************   👉  方法+事件    ****************************************

// *****************************************   👉  组件渲染    *****************************************
//  1、数据初始化、变化监听
//  2、生命周期响应

</script>

<style lang="less">
// 引入基础Mixins样式
@import "snail.view/dist/styles/mixins.less";
</style>