<!-- Elastic 弹性容器插件：上拉加载、下拉刷新扩展
    1、在弹性容器 拖拽时，实时感知是否需要进行上拉加载、下拉刷新
    2、样式信息挂载到 .snail-elastic 下
    3、使用此组件的要求，需要 y 轴启用弹性，且使用Elastic时配置dock配置（top 40；bottom 40），否则无法正常使用
    4、触发上拉加载，下拉刷新时，将通过事件通知外部
-->
<template>

</template>

<script setup lang="ts">

// *****************************************   👉  组件定义    *****************************************
//  1、props、event、model、components

//  2、组件交互变量、常量

// *****************************************   👉  方法+事件    ****************************************

// *****************************************   👉  组件渲染    *****************************************
//  1、数据初始化、变化监听
//  2、生命周期响应

</script>

<style lang="less">
// 引入基础Mixins样式
@import "snail.view/dist/styles/mixins.less";
</style>