<!-- 表单设计器：作为标案设计时，负责进行表单可视化配置 
 1、支持拖拽布局、组件配置等功能
 2、左侧字段列表，中间区域为设计区域，右侧为字段配置区域
-->
<template>

</template>

<script setup lang="ts">
import { ref, shallowRef, } from "vue";

// *****************************************   👉  组件定义    *****************************************
//  1、props、event、model、components

//  2、组件交互变量、常量
//  3、可选配置项
defineOptions({ name: "FormDesigner" });


// *****************************************   👉  方法+事件    ****************************************

// *****************************************   👉  组件渲染    *****************************************
//  1、数据初始化、变化监听
//  2、生命周期响应

</script>

<style lang="less">
// 引入基础Mixins样式
@import "snail.view/dist/styles/mixins.less";
</style>